# Pandas

In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

# Chapter 5

## Series

In [3]:
a = pd.Series([1,2,3,4,5])

In [4]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
a.values

array([1, 2, 3, 4, 5])

In [8]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
a = pd.Series([[6,7,8],[3,4,5],[1,2,3]])
a

0    [6, 7, 8]
1    [3, 4, 5]
2    [1, 2, 3]
dtype: object

### Series index

In [14]:
a = pd.Series([1,2,3],index=['a','b','c'])
a

a    1
b    2
c    3
dtype: int64

In [16]:
a = pd.Series([[1,2,3],[4,5,6],[4,5,6]],index=['jan','feb','mar'])
a

jan    [1, 2, 3]
feb    [4, 5, 6]
mar    [4, 5, 6]
dtype: object

In [18]:
list(a.index)

['jan', 'feb', 'mar']

### Series name

In [31]:
a = pd.Series([[1,2,3],[4,5,6]],index=['a','b'],name='data')
a

a    [1, 2, 3]
b    [4, 5, 6]
Name: data, dtype: object

### Getting Data

In [2]:
a = pd.Series([1,2,3,4,5],index=['M','T','W','T','F'],name='Daily Data')
a

M    1
T    2
W    3
T    4
F    5
Name: Daily Data, dtype: int64

In [3]:
a[1]

2

In [4]:
a.values[1]

2

In [5]:
a.index[1]

'T'

In [3]:
a[1]

2

In [6]:
a['M']

1

In [7]:
a[['M','T']] # fancy indexing

M    1
T    2
T    4
Name: Daily Data, dtype: int64

In [8]:
a > 3

M    False
T    False
W    False
T     True
F     True
Name: Daily Data, dtype: bool

In [9]:
a[a>3]

T    4
F    5
Name: Daily Data, dtype: int64

In [11]:
a.index[a > 3]

Index(['T', 'F'], dtype='object')

In [12]:
a = pd.Series([[1,2,3],[4,5,6],[7,8,9]],index=['jan','feb','mar'],name='monthly Data')
a

jan    [1, 2, 3]
feb    [4, 5, 6]
mar    [7, 8, 9]
Name: monthly Data, dtype: object

In [13]:
a[1]

[4, 5, 6]

In [16]:
a[1][1]

5

In [19]:
a['feb']

[4, 5, 6]

In [25]:
a[1:3]

feb    [4, 5, 6]
mar    [7, 8, 9]
Name: monthly Data, dtype: object

In [26]:
a = pd.Series([2,2,2],[3,3,3])
a

3    2
3    2
3    2
dtype: int64

In [52]:
a = np.array([1,2,])
b = np.array(['mon','tue'])

In [53]:
c = pd.Series(a,index=b)
c

mon    1
tue    2
dtype: int64

In [59]:
obj = {'m':22,'t':44,'w':{'a':[22,33]}}
obj

{'m': 22, 't': 44, 'w': {'a': [22, 33]}}

In [60]:
a = pd.Series(obj)
a

m                 22
t                 44
w    {'a': [22, 33]}
dtype: object

### isnull

In [67]:
obj = {'a':1,'b':2,'c':3}
a = pd.Series(obj,index=['a','b','c','d'])
a

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [68]:
a.isnull()

a    False
b    False
c    False
d     True
dtype: bool

In [69]:
a[a.isnull()]

d   NaN
dtype: float64

In [70]:
a[a.isnull()] = 0

In [72]:
a

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

## Data Frames

#### Merging Series

In [2]:
a = pd.Series([11,22,33,44])
b = pd.Series([56,78,90,36])

In [3]:
obj = {'col1':a , 'col2':b}

In [4]:
obj

{'col1': 0    11
 1    22
 2    33
 3    44
 dtype: int64, 'col2': 0    56
 1    78
 2    90
 3    36
 dtype: int64}

In [5]:
c = pd.DataFrame(obj)

In [6]:
c

   col1  col2
0    11    56
1    22    78
2    33    90
3    44    36

In [14]:
a = pd.Series([11,22,33,44],name='PK',index=[1,2,3,4])
b = pd.Series([56,78,90,36],name='UK',index=[1,2,3,4])
obj = {a.name:a , b.name:b} 
pd.DataFrame(obj)

   PK  UK
1  11  56
2  22  78
3  33  90
4  44  36

#### Creating from Obj

In [20]:
a = {
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
}

In [21]:
a

{'Year': [2001, 2002, 2003, 2004],
 'Country': ['Pakistan', 'India', 'Bangladesh', 'Nepal'],
 'GDP': [3, 5, 4, 4],
 'Population in (m)': [2, 12, 2, 1]}

In [24]:
b = pd.DataFrame(a,index=[1,2,3,4])
b

   Year     Country  GDP  Population in (m)
1  2001    Pakistan    3                  2
2  2002       India    5                 12
3  2003  Bangladesh    4                  2
4  2004       Nepal    4                  1

In [26]:
a = pd.Series([[1,2,3],[4,5,6]])
a

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [27]:
b = {
    'col1':a
}
b

{'col1': 0    [1, 2, 3]
 1    [4, 5, 6]
 dtype: object}

In [28]:
c = pd.DataFrame(b)
c

        col1
0  [1, 2, 3]
1  [4, 5, 6]

In [29]:
## thus Series are for single dimension and DataFrames are for multiDimension purpose

#### Extracting Data from DataFrames

In [4]:
a = pd.DataFrame({
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
},index=[1,2,3,4])

In [31]:
a

   Year     Country  GDP  Population in (m)
1  2001    Pakistan    3                  2
2  2002       India    5                 12
3  2003  Bangladesh    4                  2
4  2004       Nepal    4                  1

In [32]:
a['Country']

1      Pakistan
2         India
3    Bangladesh
4         Nepal
Name: Country, dtype: object

In [34]:
a['Country'][1]

'Pakistan'

In [39]:
a.Country[2]

'India'

In [42]:
a.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [15]:
a[2:3]

   Year     Country  GDP  Population in (m)
3  2003  Bangladesh    4                  2

In [62]:
a.loc[1]

Year                     2001
Country              Pakistan
GDP                         3
Population in (m)           2
Name: 1, dtype: object

In [67]:
a.loc[2]

Year                  2002
Country              India
GDP                      5
Population in (m)       12
Name: 2, dtype: object

In [13]:
a

   Year     Country  GDP  Population in (m)
1  2001    Pakistan    3                  2
2  2002       India    5                 12
3  2003  Bangladesh    4                  2
4  2004       Nepal    4                  1

In [16]:
print(a.loc[[1],['GDP']])

   GDP
1    3

In [118]:
a.loc[[2,3],['GDP','country']]

   GDP country
2    6      US
3    3     IND

In [18]:
a.iloc[[2,3],[0,1]]

   Year     Country
3  2003  Bangladesh
4  2004       Nepal

In [121]:
a

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6             9
3     IND    3            12

In [123]:
np.max(a)
np.min(a)

country         IND
GDP               2
Population m      4
dtype: object

In [124]:
np.exp(a.GDP)

0      7.389056
1    148.413159
2    403.428793
3     20.085537
Name: GDP, dtype: float64

#### multiTables using pandas

In [72]:
a = {
    'Pakistan':{
        2000:2,2001:3,2002:3,2004:2
    },
    "UK":{
        2000:6,2001:7,2002:2
    }
}
a

{'Pakistan': {2000: 2, 2001: 3, 2002: 3, 2004: 2},
 'UK': {2000: 6, 2001: 7, 2002: 2}}

In [73]:
b = pd.DataFrame(a)

In [74]:
b

      Pakistan   UK
2000         2  6.0
2001         3  7.0
2002         3  2.0
2004         2  NaN

## Pandas Function

#### Reindex

In [5]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12]
})

In [4]:
a

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6             9
3     IND    3            12

In [5]:
a.reindex([2,3,1,0])

  country  GDP  Population m
2      US    6             9
3     IND    3            12
1      UK    5             7
0      PK    2             4

In [10]:
a.reindex(columns=['GDP','country'],index=[2,1,3])

   GDP country
2    6      US
1    5      UK
3    3     IND

In [88]:
a.reindex([2,3,0,1],method='ffill')

  country  GDP  Population m
2      US    6             9
3     IND    3            12
0      PK    2             4
1      UK    5             7

In [17]:
a.reindex(index=[1,2,3,4,5],method='ffill')

  country  GDP  Population m
1      UK    5             7
2      US    6             9
3     IND    3            12
4     IND    3            12
5     IND    3            12

In [21]:
a.reindex(index=[1,2,3,4,5],columns=['GDP','country'])

   GDP country
1  5.0      UK
2  6.0      US
3  3.0     IND
4  NaN     NaN
5  NaN     NaN

#### drop mehtod

In [89]:
a

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6             9
3     IND    3            12

In [102]:
a.drop(index=[1,2],columns=['GDP'])

  country  Population m
0      PK             4
3     IND            12

In [113]:
a.drop('GDP',axis=1)

  country  Population m
0      PK             4
1      UK             7
2      US             9
3     IND            12

#### Arthimatic and Data Alignment

In [128]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12]
})
a

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6             9
3     IND    3            12

In [129]:
a+a

  country  GDP  Population m
0    PKPK    4             8
1    UKUK   10            14
2    USUS   12            18
3  INDIND    6            24

In [133]:
b = pd.DataFrame({
    'country':['PK','UK','US',],
    'GDP':[2,5,6],
    'Population m':[4,7,12]
})
b

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6            12

In [134]:
a+b

  country   GDP  Population m
0    PKPK   4.0           8.0
1    UKUK  10.0          14.0
2    USUS  12.0          21.0
3     NaN   NaN           NaN

In [145]:
a = pd.DataFrame({'age':[2,3,4],'hieght':[44,54,56]})
b = pd.DataFrame({'age':[2,3,4,6],'hieght':[44,54,56,45]})

In [146]:
a

   age  hieght
0    2      44
1    3      54
2    4      56

In [147]:
b

   age  hieght
0    2      44
1    3      54
2    4      56
3    6      45

In [148]:
a+b

   age  hieght
0  4.0    88.0
1  6.0   108.0
2  8.0   112.0
3  NaN     NaN

In [150]:
a.add(b,fill_value=0)

   age  hieght
0  4.0    88.0
1  6.0   108.0
2  8.0   112.0
3  6.0    45.0

In [162]:
c = pd.Series([1,2])
c

0    1
1    2
dtype: int64

In [163]:
a

   age  hieght
0    2      44
1    3      54
2    4      56

In [164]:
a-c

   age  hieght   0   1
0  NaN     NaN NaN NaN
1  NaN     NaN NaN NaN
2  NaN     NaN NaN NaN

In [165]:
a

   age  hieght
0    2      44
1    3      54
2    4      56

In [171]:
d = pd.Series([22,33,44],index=[1,2,3])
d

1    22
2    33
3    44
dtype: int64

In [172]:
a['d'] = d

In [173]:
a

   age  hieght     d
0    2      44   NaN
1    3      54  22.0
2    4      56  33.0

In [180]:
a.drop(index=[1],columns=['d'])

   age  hieght
0    2      44
2    4      56

In [193]:
a

   age  hieght     d
0    2      44   NaN
1    3      54  22.0
2    4      56  33.0

In [196]:
a[['d']]

      d
0   NaN
1  22.0
2  33.0

In [197]:
a

   age  hieght     d
0    2      44   NaN
1    3      54  22.0
2    4      56  33.0

In [22]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12]
})
a

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6             9
3     IND    3            12

In [199]:
a.sort_index(axis=0)

  country  GDP  Population m
0      PK    2             4
1      UK    5             7
2      US    6             9
3     IND    3            12

In [206]:
a.sort_values(by='country')

  country  GDP  Population m
3     IND    3            12
0      PK    2             4
1      UK    5             7
2      US    6             9

In [210]:
a.rank(method='max',axis=1)

   GDP  Population m
0  1.0           2.0
1  1.0           2.0
2  1.0           2.0
3  1.0           2.0

In [24]:
b = pd.Series([1,2],index=['GDP','Population m'])
b

GDP             1
Population m    2
dtype: int64

In [39]:
a.loc[[0,1,2,3],['GDP','Population m']]

   GDP  Population m
0    2             4
1    5             7
2    6             9
3    3            12

In [40]:
a.loc[[0,1,2,3],['GDP','Population m']] + b

   GDP  Population m
0    3             6
1    6             9
2    7            11
3    4            14

### Integer Indexing

In [27]:
a = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [28]:
a[2
 'a']

SyntaxError: invalid syntax (<ipython-input-28-3a954256d1e7>, line 2)

In [29]:
a[-1]

5

In [30]:
a = pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [31]:
a[-1]

KeyError: -1

In [32]:
a.iloc[1]

2

In [33]:
a.iloc[-1]

5

In [35]:
a = pd.DataFrame({'col1':[2,3,4],'col2':['a','s','d']})
a

   col1 col2
0     2    a
1     3    s
2     4    d

In [36]:
a.iloc[[-1],[-1]]

  col2
2    d

#### Apply Mehtod

In [23]:
a = pd.DataFrame({
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
},index=[1,2,3,4])
a

   Year     Country  GDP  Population in (m)
1  2001    Pakistan    3                  2
2  2002       India    5                 12
3  2003  Bangladesh    4                  2
4  2004       Nepal    4                  1

In [24]:
f = lambda x: x.max()
f2 = lambda x: x+100

In [33]:
a.apply(f,axis=0)

Year                     2004
Country              Pakistan
GDP                         5
Population in (m)          12
dtype: object

In [74]:
a = pd.DataFrame({
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
},index=[1,2,3,4])
a

   GDP  Population in (m)
1    3                  2
2    5                 12
3    4                  2
4    4                  1

In [75]:
a.applymap(f2)

   GDP  Population in (m)
1  103                102
2  105                112
3  104                102
4  104                101

#### Sorting and Ranking

In [81]:
a = pd.DataFrame({
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
},index=[4,1,2,3])
a

   Year     Country  GDP  Population in (m)
4  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [82]:
b = pd.Series([22,33,44,55],index=['c','d','a','b'])
b

c    22
d    33
a    44
b    55
dtype: int64

In [83]:
b.sort_index()

a    44
b    55
c    22
d    33
dtype: int64

In [84]:
a.sort_index()

   Year     Country  GDP  Population in (m)
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1
4  2001    Pakistan    3                  2

In [85]:
b.sort_values()

c    22
d    33
a    44
b    55
dtype: int64

In [86]:
a.sort_values(by='Year')

   Year     Country  GDP  Population in (m)
4  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [95]:
a.sort_values(by='GDP',ascending=False)

   Year     Country  GDP  Population in (m)
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1
4  2001    Pakistan    3                  2

In [96]:
a.sort_values(by=['GDP','Population in (m)'])

   Year     Country  GDP  Population in (m)
4  2001    Pakistan    3                  2
3  2004       Nepal    4                  1
2  2003  Bangladesh    4                  2
1  2002       India    5                 12

In [97]:
a.sort_values(by=['Population in (m)','GDP'])

   Year     Country  GDP  Population in (m)
3  2004       Nepal    4                  1
4  2001    Pakistan    3                  2
2  2003  Bangladesh    4                  2
1  2002       India    5                 12

In [98]:
b

c    22
d    33
a    44
b    55
dtype: int64

In [102]:
b.rank(method='dense')

c    1.0
d    2.0
a    3.0
b    4.0
dtype: float64

In [103]:
a

   Year     Country  GDP  Population in (m)
4  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [107]:
a.rank(axis=0)

   Year  Country  GDP  Population in (m)
4   1.0      4.0  1.0                2.5
1   2.0      2.0  4.0                4.0
2   3.0      1.0  2.5                2.5
3   4.0      3.0  2.5                1.0

In [112]:
b.rank(method='first')

c    1.0
d    2.0
a    3.0
b    4.0
dtype: float64

### Stats Mehtods

In [3]:
a = pd.DataFrame({
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
},index=[4,1,2,3])
a

   Year     Country  GDP  Population in (m)
4  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [9]:
b = pd.DataFrame({
    "Year":[2001,2002,2003,2004],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
},index=[4,1,2,3])
b

   Year  GDP  Population in (m)
4  2001    3                  2
1  2002    5                 12
2  2003    4                  2
3  2004    4                  1

In [4]:
a.sum()

Year                                         8010
Country              PakistanIndiaBangladeshNepal
GDP                                            16
Population in (m)                              17
dtype: object

In [5]:
a.sum(axis=1)

4    2006
1    2019
2    2009
3    2009
dtype: int64

In [6]:
a.mean()

Year                 2002.50
GDP                     4.00
Population in (m)       4.25
dtype: float64

In [11]:
b.max()

Year                 2004
GDP                     5
Population in (m)      12
dtype: int64

In [12]:
b.idxmax(axis=1)

4    Year
1    Year
2    Year
3    Year
dtype: object

In [13]:
b.idxmax(axis=0)

Year                 3
GDP                  1
Population in (m)    1
dtype: int64

In [14]:
a.cumsum()

   Year                       Country GDP Population in (m)
4  2001                      Pakistan   3                 2
1  4003                 PakistanIndia   8                14
2  6006       PakistanIndiaBangladesh  12                16
3  8010  PakistanIndiaBangladeshNepal  16                17

In [15]:
a.describe()

              Year       GDP  Population in (m)
count     4.000000  4.000000           4.000000
mean   2002.500000  4.000000           4.250000
std       1.290994  0.816497           5.188127
min    2001.000000  3.000000           1.000000
25%    2001.750000  3.750000           1.750000
50%    2002.500000  4.000000           2.000000
75%    2003.250000  4.250000           4.500000
max    2004.000000  5.000000          12.000000

### data from DataReader

In [28]:
from pandas_datareader import wb

In [29]:
matches = wb.search('gdp.*capita.*const')

In [40]:
dat = wb.download(indicator='NY.GDP.PCAP.KD', country=['US', 'CA', 'MX'], start=2005, end=2010)

In [41]:
dat

                    NY.GDP.PCAP.KD
country       year
Canada        2010    47450.318470
              2009    46542.904868
              2008    48497.560167
              2007    48536.539413
              2006    48014.931197
              2005    47257.472197
Mexico        2010     9271.398233
              2009     8947.741474
              2008     9587.636339
              2007     9622.047957
              2006     9547.333571
              2005     9270.656542
United States 2010    48466.823375
              2009    47648.813251
              2008    49319.478865
              2007    49856.281491
              2006    49405.767296
              2005    48499.812376

### series Mehtods

In [44]:
a = pd.Series(['a','b','c','c','d','e','e'])
a

0    a
1    b
2    c
3    c
4    d
5    e
6    e
dtype: object

In [45]:
a.unique()

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [48]:
a.value_counts()

c    2
e    2
d    1
a    1
b    1
dtype: int64

In [50]:
a.isin(['a','e'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

# Chapter 6

## reading/writing data from Textfiles

### read_csv and read_table

In [52]:
import pandas as pd

In [57]:
file1 = pd.read_csv('csvFiles/csvfile1.csv')

In [58]:
file1

    Country  GDP  Population  Per Capita Income
0  Pakistan    4          25                500
1     China    9         100               1000
2       USA    8          89               1300
3        UK    7          46               1400
4   England    8          32               1200

In [61]:
file1 = pd.read_csv('csvFiles/csvfile1.csv',header=None)
file1

          0    1           2                  3
0   Country  GDP  Population  Per Capita Income
1  Pakistan    4          25                500
2     China    9         100               1000
3       USA    8          89               1300
4        UK    7          46               1400
5   England    8          32               1200

In [65]:
file1 = pd.read_csv('csvFiles/csvfile1.csv',names=['col1','col2','col3','col4','col5'])
file1

       col1 col2        col3               col4  col5
0   Country  GDP  Population  Per Capita Income   NaN
1  Pakistan    4          25                500   NaN
2     China    9         100               1000   NaN
3       USA    8          89               1300   NaN
4        UK    7          46               1400   NaN
5   England    8          32               1200   NaN

In [68]:
file1 = pd.read_csv('csvFiles/csvfile1.csv',index_col='Country')
file1

          GDP  Population  Per Capita Income
Country
Pakistan    4          25                500
China       9         100               1000
USA         8          89               1300
UK          7          46               1400
England     8          32               1200

In [73]:
file1.loc[['UK'],['GDP']]

         GDP
Country
UK         7

In [80]:
file1 = pd.read_csv('csvFiles/csvfile2.csv',nrows=10)
file1

    Country  GDP  Population  Per Capita Income
0  Pakistan    4          25                500
1     China    9         100               1000
2       USA    8          89               1300
3        UK    7          46               1400
4   England    8          32               1200
5  Pakistan    4          25                500
6     China    9         100               1000
7       USA    8          89               1300
8        UK    7          46               1400
9   England    8          32               1200

In [34]:
file1 = pd.read_csv('csvFiles/csvfile2.csv',chunksize=10)
file1

In [82]:
for a in file1:
    print('this',a)

this     Country  GDP  Population  Per Capita Income
0  Pakistan    4          25                500
1     China    9         100               1000
2       USA    8          89               1300
3        UK    7          46               1400
4   England    8          32               1200
5  Pakistan    4          25                500
6     China    9         100               1000
7       USA    8          89               1300
8        UK    7          46               1400
9   England    8          32               1200
this      Country  GDP  Population  Per Capita Income
10  Pakistan    4          25                500
11     China    9         100               1000
12       USA    8          89               1300
13        UK    7          46               1400
14   England    8          32               1200
15  Pakistan    4          25                500
16     China    9         100               1000
17       USA    8          89               1300
18        UK    7          46               1400
19   England    8          32               1200
this      Country  GDP  Population  Per Capita Income
20  Pakistan    4          25                500
21     China    9         100               1000
22       USA    8          89               1300
23        UK    7          46               1400
24   England    8          32               1200
25  Pakistan    4          25                500
26     China    9         100               1000
27       USA    8          89               1300
28        UK    7          46               1400
29   England    8          32               1200
this      Country  GDP  Population  Per Capita Income
30  Pakistan    4          25                500
31     China    9         100               1000
32       USA    8          89               1300
33        UK    7          46               1400
34   England    8          32               1200
35  Pakistan    4          25                500
36     China    9         100               1000
37       USA    8          89               1300
38        UK    7          46               1400
39   England    8          32               1200
this      Country  GDP  Population  Per Capita Income
40  Pakistan    4          25                500
41     China    9         100               1000
42       USA    8          89               1300
43        UK    7          46               1400
44   England    8          32               1200
45  Pakistan    4          25                500
46     China    9         100               1000
47       USA    8          89               1300
48        UK    7          46               1400
49   England    8          32               1200
this      Country  GDP  Population  Per Capita Income
50  Pakistan    4          25                500
51     China    9         100               1000
52       USA    8          89               1300
53        UK    7          46               1400
54   England    8          32               1200
55  Pakistan    4          25                500
56     China    9         100               1000
57       USA    8          89               1300
58        UK    7          46               1400
59   England    8          32               1200

In [87]:
file1 = pd.read_csv('csvFiles/csvfile1.csv',index_col='Country',skiprows=[5,1])
file1

         GDP  Population  Per Capita Income
Country
China      9         100               1000
USA        8          89               1300
UK         7          46               1400
England    8          32               1200

### Write Data .to_csv()

In [2]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [5]:
a.to_csv('csvFiles/csvfile3.csv',sep='-')

In [29]:
a.to_csv('csvFiles/csvfile3.csv',index=None,header=['col1','col2','col3','col4'])

In [30]:
file3 = pd.read_csv('csvFiles/csvfile3.csv')
file3

  col1  col2  col3  col4
0   PK     2     4    24
1   UK     5     7    56
2   US     6     9    45
3  IND     3    12    28

In [34]:
b = pd.Series(['a','b','c','d','e'],index=['a','b','c','d','e'])
b

a    a
b    b
c    c
d    d
e    e
dtype: object

In [35]:
b.to_csv('csvFiles/csvfile4.csv')

/home/mshahzaib/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [36]:
file4 = pd.read_csv('csvFiles/csvfile4.csv')
file4

   a a.1
0  b   b
1  c   c
2  d   d
3  e   e

### json data

In [39]:
import json

In [45]:
file1 = json.loads('{ "name":"John", "age":30, "car":null }')

In [46]:
file1

{'name': 'John', 'age': 30, 'car': None}

In [47]:
json.dumps(file1)

'{"name": "John", "age": 30, "car": null}'

In [69]:
file2 = pd.read_json('jsonFiles/jsonfile1.json',orient='')

In [64]:
file2

,cms_prescription_counts,provider_variables,npi
CEPHALEXIN,23.0,NaN,1992715205
AMOXICILLIN,52.0,NaN,1992715205
HYDROCODONE-ACETAMINOPHEN,28.0,NaN,1992715205
settlement_type,NaN,non-urban,1992715205
generic_rx_count,NaN,103,1992715205
specialty,NaN,General Practice,1992715205
years_practicing,NaN,7,1992715205
gender,NaN,M,1992715205
region,NaN,South,1992715205
brand_name_rx_count,NaN,0,1992715205

In [70]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [72]:
a.to_json('jsonFiles/jsonfile2.json')

### HTML data parsing (web scrapping)

In [2]:
file1 = pd.read_html('htmlFiles/htmlFile1.html')

In [3]:
file1

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [93]:
file1[0]

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [94]:
file1[1]

          Tag                                        Description
0     <table>                                    Defines a table
1        <th>                   Defines a header cell in a table
2        <tr>                           Defines a row in a table
3        <td>                          Defines a cell in a table
4   <caption>                            Defines a table caption
5  <colgroup>  Specifies a group of one or more columns in a ...
6       <col>  Specifies column properties for each column wi...
7     <thead>               Groups the header content in a table
8     <tbody>                 Groups the body content in a table
9     <tfoot>               Groups the footer content in a table

In [4]:
len(file1)

2

In [5]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [8]:
a.to_html("htmlFiles/htmlFile2.txt")

In [9]:
a.to_html("htmlFiles/htmlFile2.html")

### BeautifulSoap Web Scrapper

In [5]:
from bs4 import BeautifulSoup

In [6]:
f = open("htmlFiles/htmlFile1.html")

In [7]:
soup = BeautifulSoup(f, 'html.parser')

In [11]:
soup.p

### Binary Data Formats

In [2]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [14]:
a.to_pickle("binaryFiles/binarFile1.txt")

In [15]:
b = pd.read_pickle("binaryFiles/binarFile1.txt")

In [16]:
b

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

#### HDF5 binary data format

In [21]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [22]:
a.to_hdf("hdf5Files/hdfFile1.h5","obj2",format='table')

In [25]:
b = pd.read_hdf("hdf5Files/hdfFile1.h5","obj2")

In [26]:
b

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [27]:
store = pd.HDFStore("hdf5Files/hdfFile1.h5")

In [28]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: hdf5Files/hdfFile1.h5

In [29]:
store.obj1

   GDP  Population m  Avg Age
0    2             4       24
1    5             7       56
2    6             9       45
3    3            12       28

In [30]:
store.obj2

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [31]:
a = pd.DataFrame({
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

   Population m  Avg Age
0             4       24
1             7       56
2             9       45
3            12       28

In [32]:
store.put('obj3',a)

In [33]:
store.obj3

   Population m  Avg Age
0             4       24
1             7       56
2             9       45
3            12       28

In [34]:
store.close()

In [35]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: hdf5Files/hdfFile1.h5

### Data storing using Excel Files

In [37]:
pd.read_excel('excelFiles/excelFile1.xls',header=None)

          0    1           2     3
0      Name  Age  Percentage  Rank
1  Shahzaib   18         100     1
2      Azan   19          90     2
3     Bilal   17          80     4
4    Yassen   20          20     5
5     Hamza   27          89     3

In [38]:
pd.read_excel('excelFiles/excelFile1.xls')

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
1      Azan   19          90     2
2     Bilal   17          80     4
3    Yassen   20          20     5
4     Hamza   27          89     3

In [39]:
pd.read_excel('excelFiles/excelFile2.xls')

,PIAIC AIC ONSITE & ONLINE TEST SCHEDULE,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254,Unnamed: 255
0,FEMALE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Roll #,Type,Day,Date,Time,Location,Quiz Description,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AIC000054,NaN,NaN,NaN,NaN,NaN,NaN,Onsite,Monday,25th Nov,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AIC000088,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AIC000409,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3337,AIC008147,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3338,AIC005193,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3339,AIC007356,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3340,AIC010653,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3341,AIC007713,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [40]:
a = pd.DataFrame({
    'country':['PK','UK','US','IND'],
    'GDP':[2,5,6,3],
    'Population m':[4,7,9,12],
    'Avg Age':[24,56,45,28]
})
a

  country  GDP  Population m  Avg Age
0      PK    2             4       24
1      UK    5             7       56
2      US    6             9       45
3     IND    3            12       28

In [41]:
a.to_excel('excelFiles/excelFile3.xls')

In [42]:
pd.read_excel('excelFiles/excelFile3.xls')

   Unnamed: 0 country  GDP  Population m  Avg Age
0           0      PK    2             4       24
1           1      UK    5             7       56
2           2      US    6             9       45
3           3     IND    3            12       28

### Intreacting with Web Apis

In [43]:
import requests

In [48]:
url = "http://api.github.com/repos/pandas-dev/pandas/issues"

In [49]:
res = requests.get(url)

In [50]:
res

In [52]:
res = res.json()

In [55]:
res[0]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/29703',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/29703/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/29703/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/29703/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/29703',
 'id': 524728941,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0MzQyNDUxNTI4',
 'number': 29703,
 'title': 'TYP: more annotations for io.pytables',
 'user': {'login': 'jbrockmendel',
  'id': 8078968,
  'node_id': 'MDQ6VXNlcjgwNzg5Njg=',
  'avatar_url': 'https://avatars1.githubusercontent.com/u/8078968?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/jbrockmendel',
  'html_url': 'https://github.com/jbrockmendel',
  'followers_url': 'https://api.github.com/users/jbrockmendel/followers',
  'following_url': 'https://api.github.com/users/jbrockmendel/following{/other_user}',
  'gists_url': 'https://api.github.com/users/jbrockmendel/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/jbrockmendel/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/jbrockmendel/subscriptions',
  'organizations_url': 'https://api.github.com/users/jbrockmendel/orgs',
  'repos_url': 'https://api.github.com/users/jbrockmendel/repos',
  'events_url': 'https://api.github.com/users/jbrockmendel/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/jbrockmendel/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [{'id': 1280988427,
   'node_id': 'MDU6TGFiZWwxMjgwOTg4NDI3',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Typing',
   'name': 'Typing',
   'color': 'ea91a4',
   'default': False}],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': {'url': 'https://api.github.com/repos/pandas-dev/pandas/milestones/16',
  'html_url': 'https://github.com/pandas-dev/pandas/milestone/16',
  'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/milestones/16/labels',
  'id': 174211,
  'node_id': 'MDk6TWlsZXN0b25lMTc0MjEx',
  'number': 16,
  'title': '1.0',
  'description': '',
  'creator': {'login': 'wesm',
   'id': 329591,
   'node_id': 'MDQ6VXNlcjMyOTU5MQ==',
   'avatar_url': 'https://avatars2.githubusercontent.com/u/329591?v=4',
   'gravatar_id': '',
   'url': 'https://api.github.com/users/wesm',
   'html_url': 'https://github.com/wesm',
   'followers_url': 'https://api.github.com/users/wesm/followers',
   'following_url': 'https://api.github.com/users/wesm/following{/other_user}',
   'gists_url': 'https://api.github.com/users/wesm/gists{/gist_id}',
   'starred_url': 'https://api.github.com/users/wesm/starred{/owner}{/repo}',
   'subscriptions_url': 'https://api.github.com/users/wesm/subscriptions',
   'organizations_url': 'https://api.github.com/users/wesm/orgs',
   'repos_url': 'https://api.github.com/users/wesm/repos',
   'events_url': 'https://api.github.com/users/wesm/events{/privacy}',
   'received_events_url': 'https://api.github.com/users/wesm/received_events',
   'type': 'User',
   'site_admin': False},
  'open_issues': 131,
  'closed_issues': 1099,
  'state': 'open',
  'created_at': '2012-09-13T02:13:00Z',
  'updated_at': '2019-11-19T04:06:58Z',
  'due_on': '2019-12-01T08:00:00Z',
  'closed_at': None},
 'comments': 0,
 'created_at': '2019-11-19T02:12:24Z',
 'updated_at': '2019-11-19T03:45:46Z',
 'closed_at': None,
 'author_association': 'MEMBER',
 'pull_request': {'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/29703',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/29703',
  'diff_url': 'https://github.com/pandas-dev/pandas/pull/29703.diff',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/29703.patch'},
 'body': 'should be orthogonal to #29692.'}

In [58]:
pd.DataFrame(res,columns=['number','title','labels','state'])

,number,title,labels,state
0,29703,TYP: more annotations for io.pytables,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
1,29702,REF: use _extract_result in Reducer.get_result,[],open
2,29701,format replaced with f-strings,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
3,29700,"BUG: Index.get_loc raising incorrect error, cl...","[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
4,29699,MultiIndex-Columns Integer and String: Column ...,[],open
5,29698,REF: dont _try_cast for user-defined functions,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
6,29697,BUG: merge raises for how='outer'/'right' when...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,29696,CI: Use conda for 3.8 build,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
8,29695,restore clipboard setup?,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
9,29694,TST: Split pandas/tests/frame/test_indexing in...,[],open
10,29693,Removed compat_helper.h,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
11,29692,REF: ensure name and cname are always str,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
12,29690,BUG: Series groupby does not include nan count...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
13,29689,Put some marker in the DOCs for functions need...,[],open
14,29688,Group some columns in subplots with DataFrame....,[],open
15,29687,"'sort_index""does not work with 'pd.set_option(...",[],open
16,29686,API: any/all in context of boolean dtype with ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
17,29685,CI: Inconsistencies in the CI tests,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
18,29684,OutOfBoundsDatetime for big-endian np.datetime...,[],open
19,29678,DEPS: Unifying testing and building dependenci...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
20,29676,CI: Clipboard Test Failures on Travis,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
21,29672,REF: align transform logic flow,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
22,29671,CI: Speed up coverage tests by splitting files,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
23,29670,BUG: extra leading space in to_string when ind...,"[{'id': 13101118, 'node_id': 'MDU6TGFiZWwxMzEw...",open
24,29669,ENH: Add suffixes argument for pd.concat,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
25,29668,"parameter ""na_values"" in read_excel() not effe...",[],open
26,29664,CI: Unify pytest versions across builds,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
27,29657,BUG: resolved problem with DataFrame.equals() ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,29654,CI: Format isort output for azure,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
29,29650,read_fwf raises BytesWarning when running with...,[],open

### Sqlite database

In [2]:
import sqlite3

##### creating table

In [29]:
query = "CREATE TABLE table2(a VARCHAR(10),b VARCHAR(10),c REAL);"

In [30]:
con = sqlite3.connect('sqliteDatabase/database1.sqlite')

In [31]:
con.execute(query)
con.commit

##### inserting data

In [32]:
data = [('Shahzaib','Shoaib',19),('andrew','nig',21),('ali','rana',8)]

In [35]:
stmt = 'INSERT INTO table2 VALUES(?,?,?)'

In [36]:
con.executemany(stmt,data)

In [37]:
con.commit()

##### extracting data

In [38]:
cursor = con.execute('select * from table2')

In [39]:
cursor

In [40]:
rows = cursor.fetchall()

In [41]:
rows

[('Shahzaib', 'Shoaib', 19.0), ('andrew', 'nig', 21.0), ('ali', 'rana', 8.0)]

##### dataframe from database

In [43]:
a = pd.DataFrame(rows,columns=["name","lastName","age"])
a

       name lastName   age
0  Shahzaib   Shoaib  19.0
1    andrew      nig  21.0
2       ali     rana   8.0

# Chapter 7

## Handling Missing Data

In [9]:
a = pd.Series([1,2,3,4,5,None],index=['a','b','c','d','e','f'])

In [10]:
a

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
dtype: float64

In [11]:
a.isnull()

a    False
b    False
c    False
d    False
e    False
f     True
dtype: bool

In [12]:
a = pd.Series(['1','2','3','4',5,None],index=['a','b','c','d','e','f'])

In [13]:
a

a       1
b       2
c       3
d       4
e       5
f    None
dtype: object

In [23]:
a[a.isnull()] = 1
a

a    1
b    2
c    3
d    4
e    5
f    1
dtype: object

In [38]:
a = pd.DataFrame([{'a':1,'b':2,'c':3},{'a':1,'b':None,'c':3},{'a':1,'b':2,'c':NA}])

In [39]:
a

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN

In [40]:
a.notnull()

      a      b      c
0  True   True   True
1  True  False   True
2  True   True  False

In [41]:
a[a.notnull()]

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN

#### Dropana()

In [36]:
a = pd.read_excel('excelFiles/excelFile1.xls')

In [37]:
a

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
1      Azan   19          90     2
2     Bilal   17          80     4
3    Yassen   20          20     5
4     Hamza   27          89     3

In [39]:
a.iloc[4,1] = NA

In [40]:
a.iloc[2,2] = NA

In [41]:
a.iloc[2,0] = NA

In [51]:
a

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

In [54]:
a[a.notnull()] #fails

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

In [55]:
a.dropna()

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
3    Yassen  20.0        20.0     5

In [56]:
a.dropna(how='all')

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

In [57]:
a.dropna(axis=1)

   Rank
0     1
1     2
2     4
3     5
4     3

In [65]:
a.dropna(thresh=3)

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

#### fillna()

In [42]:
a

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

In [43]:
a.fillna(0)

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2         0  17.0         0.0     4
3    Yassen  20.0        20.0     5
4     Hamza   0.0        89.0     3

In [44]:
a.fillna({'Name':'unknown','Age':18,'Percentage':50})

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2   unknown  17.0        50.0     4
3    Yassen  20.0        20.0     5
4     Hamza  18.0        89.0     3

In [71]:
a

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

In [45]:
a.fillna(method='ffill')

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2      Azan  17.0        90.0     4
3    Yassen  20.0        20.0     5
4     Hamza  20.0        89.0     3

In [75]:
a.fillna(method='ffill',axis=1)

       Name    Age Percentage Rank
0  Shahzaib     18        100    1
1      Azan     19         90    2
2       NaN     17         17    4
3    Yassen     20         20    5
4     Hamza  Hamza         89    3

In [93]:
a= a.fillna({'Name':'unknown','Age':18,'Percentage':a['Percentage'].mean()})

In [94]:
a['Percentage'].mean()

74.75

#### Duplicates()

In [46]:
a

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

In [48]:
a.duplicated(['Rank'])

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [99]:
a.duplicated(['Age'])

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [101]:
a.drop_duplicates(['Age'])

       Name   Age  Percentage  Rank
0  Shahzaib  18.0      100.00     1
1      Azan  19.0       90.00     2
2   unknown  17.0       74.75     4
3    Yassen  20.0       20.00     5

#### mapping

In [102]:
a

       Name   Age  Percentage  Rank
0  Shahzaib  18.0      100.00     1
1      Azan  19.0       90.00     2
2   unknown  17.0       74.75     4
3    Yassen  20.0       20.00     5
4     Hamza  18.0       89.00     3

In [107]:
a['Name'].map(lambda x: x.upper())

0    SHAHZAIB
1        AZAN
2     UNKNOWN
3      YASSEN
4       HAMZA
Name: Name, dtype: object

In [109]:
a['Name'].map(lambda x: x+' khan')

0    Shahzaib khan
1        Azan khan
2     unknown khan
3      Yassen khan
4       Hamza khan
Name: Name, dtype: object

In [111]:
a['Name'].map(lambda x: (x+' khan').title())

0    Shahzaib Khan
1        Azan Khan
2     Unknown Khan
3      Yassen Khan
4       Hamza Khan
Name: Name, dtype: object

In [130]:
college = pd.Series(['Alpha','Roots','Alpha','Alpha','Nixor'],index=[0,1,4,3,2])

In [131]:
a['College'] = college

In [132]:
a

       Name   Age  Percentage  Rank College
0  Shahzaib  18.0      100.00     1   Alpha
1      Azan  19.0       90.00     2   Roots
2   unknown  17.0       74.75     4   Nixor
3    Yassen  20.0       20.00     5   Alpha
4     Hamza  18.0       89.00     3   Alpha

In [49]:
a.applymap(lambda x: x)

       Name   Age  Percentage  Rank
0  Shahzaib  18.0       100.0     1
1      Azan  19.0        90.0     2
2       NaN  17.0         NaN     4
3    Yassen  20.0        20.0     5
4     Hamza   NaN        89.0     3

#### replace

In [135]:
a

       Name   Age  Percentage  Rank College
0  Shahzaib  18.0      100.00     1   Alpha
1      Azan  19.0       90.00     2   Roots
2   unknown  17.0       74.75     4   Nixor
3    Yassen  20.0       20.00     5   Alpha
4     Hamza  18.0       89.00     3   Alpha

In [136]:
a.replace("Alpha",'beta')

       Name   Age  Percentage  Rank College
0  Shahzaib  18.0      100.00     1    beta
1      Azan  19.0       90.00     2   Roots
2   unknown  17.0       74.75     4   Nixor
3    Yassen  20.0       20.00     5    beta
4     Hamza  18.0       89.00     3    beta

In [137]:
a.replace(["Alpha",'Roots'],'beta')

       Name   Age  Percentage  Rank College
0  Shahzaib  18.0      100.00     1    beta
1      Azan  19.0       90.00     2    beta
2   unknown  17.0       74.75     4   Nixor
3    Yassen  20.0       20.00     5    beta
4     Hamza  18.0       89.00     3    beta

In [138]:
a.replace(["Alpha",'Roots'],['beta','Doots'])

       Name   Age  Percentage  Rank College
0  Shahzaib  18.0      100.00     1    beta
1      Azan  19.0       90.00     2   Doots
2   unknown  17.0       74.75     4   Nixor
3    Yassen  20.0       20.00     5    beta
4     Hamza  18.0       89.00     3    beta

#### Renaming Indexes

In [4]:
a = pd.read_excel('excelFiles/excelFile1.xls')
a

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
1      Azan   19          90     2
2     Bilal   17          80     4
3    Yassen   20          20     5
4     Hamza   27          89     3

In [5]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
a.columns

Index(['Name', 'Age', 'Percentage', 'Rank'], dtype='object')

In [8]:
a.index.map(lambda x:3)

Int64Index([3, 3, 3, 3, 3], dtype='int64')

In [9]:
a

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
1      Azan   19          90     2
2     Bilal   17          80     4
3    Yassen   20          20     5
4     Hamza   27          89     3

In [11]:
a.rename(index={0:1,1:2,2:3,3:4,4:5},columns={'Rank':'Position'})

       Name  Age  Percentage  Position
1  Shahzaib   18         100         1
2      Azan   19          90         2
3     Bilal   17          80         4
4    Yassen   20          20         5
5     Hamza   27          89         3

#### Discritization

In [15]:
ages = [15,12,10,8,9,20,25,27,19,25,34,35,39,43,49,50,58,61]
bins = [0,18,30,40,60,100]

In [18]:
b = pd.cut(ages,bins,labels=['child','teen','young','adult','old'])

In [20]:
b

[child, child, child, child, child, ..., adult, adult, adult, adult, old]
Length: 18
Categories (5, object): [child < teen < young < adult < old]

In [21]:
pd.value_counts(b)

teen     5
child    5
adult    4
young    3
old      1
dtype: int64

In [37]:
b = pd.qcut(ages,6)

In [38]:
pd.value_counts(b)

(49.167, 61.0]      3
(36.333, 49.167]    3
(26.0, 36.333]      3
(19.667, 26.0]      3
(11.667, 19.667]    3
(7.999, 11.667]     3
dtype: int64

In [39]:
np.abs(-1)

1

In [40]:
a

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
1      Azan   19          90     2
2     Bilal   17          80     4
3    Yassen   20          20     5
4     Hamza   27          89     3

In [41]:
c = a['Percentage']

In [42]:
c

0    100
1     90
2     80
3     20
4     89
Name: Percentage, dtype: int64

In [43]:
c[c>50]

0    100
1     90
2     80
4     89
Name: Percentage, dtype: int64

#### Random sampling

In [55]:
sampler = np.random.permutation((5))
sampler

array([2, 4, 3, 0, 1])

In [56]:
a

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
1      Azan   19          90     2
2     Bilal   17          80     4
3    Yassen   20          20     5
4     Hamza   27          89     3

In [57]:
a.take(sampler)

       Name  Age  Percentage  Rank
2     Bilal   17          80     4
4     Hamza   27          89     3
3    Yassen   20          20     5
0  Shahzaib   18         100     1
1      Azan   19          90     2

In [65]:
a.sample(n=2)

       Name  Age  Percentage  Rank
3    Yassen   20          20     5
0  Shahzaib   18         100     1

In [68]:
a.sample(n=4,replace=True)

       Name  Age  Percentage  Rank
0  Shahzaib   18         100     1
3    Yassen   20          20     5
1      Azan   19          90     2
1      Azan   19          90     2

### String Manupulatino

In [70]:
a = 'a,b ,c ,d, e ,f'

In [72]:
a.split(',')

['a', 'b ', 'c ', 'd', ' e ', 'f']

In [73]:
a.split(' ')

['a,b', ',c', ',d,', 'e', ',f']

In [82]:
'abc'.join('qqqq')

'qabcqabcqabcq'

In [83]:
'www'.join(a.split(','))

'awwwb wwwc wwwdwww e wwwf'

In [84]:
a = 'Shahzaib'

In [85]:
a.find('z')

4

In [86]:
a.find('q')

-1

In [87]:
a.index('z')

4

In [88]:
a.index('q')

ValueError: substring not found

In [96]:
a in 'Shahzaibb'

True

In [97]:
a

'Shahzaib'

In [99]:
a.count('h')

2

In [100]:
a.count('hp')

0

In [105]:
'ss                an d sds'.strip()

'ss                an d sds'

In [106]:
a = 'Shah zaib sa as '

### Regex

In [111]:
import re

In [112]:
a = "mshahzaib101ed@gmail.com"

In [115]:
b = re.compile(a)
b

re.compile(r'mshahzaib101ed@gmail.com', re.UNICODE)

In [117]:
a == b

False

In [121]:
re.match(b,'ll')

In [122]:
re.match(b,a)

In [133]:
re.match(b,'mshahzaib101ed@gmail.com')

In [134]:
c = re.match(b,'ss')

In [136]:
print(c)

None

##### Practice

In [65]:
a = {
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
}
a = pd.DataFrame(a)

In [52]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [63]:
a=a.rename(index={0:'ld'})

In [64]:
a

    Year     Country  GDP  Population in (m)
ld  2001    Pakistan    3                  2
1   2002       India    5                 12
2   2003  Bangladesh    4                  2
3   2004       Nepal    4                  1

In [66]:
bina = [1,2,1,1,3,4,5,6,6,7,7,8,9,8,7,6,4,1,1]

In [70]:
rangea = [0,5,10]

In [71]:
cat = pd.cut(bina,rangea)

In [72]:
cat

[(0, 5], (0, 5], (0, 5], (0, 5], (0, 5], ..., (5, 10], (5, 10], (0, 5], (0, 5], (0, 5]]
Length: 19
Categories (2, interval[int64]): [(0, 5] < (5, 10]]

In [73]:
pd.value_counts(cat)

(0, 5]     10
(5, 10]     9
dtype: int64

In [74]:
cat = pd.qcut(bina,4)

In [75]:
cat

[(0.999, 1.5], (1.5, 5.0], (0.999, 1.5], (0.999, 1.5], (1.5, 5.0], ..., (5.0, 7.0], (5.0, 7.0], (1.5, 5.0], (0.999, 1.5], (0.999, 1.5]]
Length: 19
Categories (4, interval[float64]): [(0.999, 1.5] < (1.5, 5.0] < (5.0, 7.0] < (7.0, 9.0]]

In [76]:
pd.value_counts(cat)

(5.0, 7.0]      6
(1.5, 5.0]      5
(0.999, 1.5]    5
(7.0, 9.0]      3
dtype: int64

In [77]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [78]:
a.take([2,3])

   Year     Country  GDP  Population in (m)
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [81]:
a.sample(2)

   Year     Country  GDP  Population in (m)
2  2003  Bangladesh    4                  2
1  2002       India    5                 12

In [83]:
a = 'll,k, o'.split(',')

In [84]:
a

['ll', 'k', ' o']

In [85]:
''.join(a)

'llk o'

## Chapter 8

In [86]:
a = {
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
}
a = pd.DataFrame(a)

In [87]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

### Hierachical indexing

In [88]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [89]:
a.stack()

0  Year                       2001
   Country                Pakistan
   GDP                           3
   Population in (m)             2
1  Year                       2002
   Country                   India
   GDP                           5
   Population in (m)            12
2  Year                       2003
   Country              Bangladesh
   GDP                           4
   Population in (m)             2
3  Year                       2004
   Country                   Nepal
   GDP                           4
   Population in (m)             1
dtype: object

In [95]:
b=pd.DataFrame(np.random.rand(9),index=[['a','a','a','b','b','c','c','c','c'],['1','2','3','1','2','1','2','3','4']])
b

            0
a 1  0.491184
  2  0.399816
  3  0.766219
b 1  0.194010
  2  0.534374
c 1  0.900773
  2  0.929284
  3  0.094982
  4  0.923662

In [97]:
b=pd.DataFrame(np.random.rand(9),index=[['a','a','a','b','b','c','c','c','c'],['1','1','2','2','2','2','2','4','4'],[22,33,44,55,66,44,33,24,33]])
b

               0
a 1 22  0.090355
    33  0.617948
  2 44  0.090010
b 2 55  0.423744
    66  0.194359
c 2 44  0.893907
    33  0.255249
  4 24  0.565792
    33  0.060868

In [101]:
b=pd.DataFrame(np.random.rand(9,2),columns=[['color','color'],['red','blue']],index=[['a','a','a','b','b','c','c','c','c'],['1','2','3','1','2','1','2','3','4']])
b

        color
          red      blue
a 1  0.132308  0.959557
  2  0.833845  0.681229
  3  0.095278  0.278363
b 1  0.564451  0.511612
  2  0.701554  0.708023
c 1  0.062733  0.052607
  2  0.049134  0.268648
  3  0.199277  0.057458
  4  0.717697  0.018762

In [102]:
b.unstack()

      color                                                              \
        red                                    blue
          1         2         3         4         1         2         3
a  0.132308  0.833845  0.095278       NaN  0.959557  0.681229  0.278363
b  0.564451  0.701554       NaN       NaN  0.511612  0.708023       NaN
c  0.062733  0.049134  0.199277  0.717697  0.052607  0.268648  0.057458



          4
a       NaN
b       NaN
c  0.018762

In [103]:
b.stack()

             color
a 1 blue  0.959557
    red   0.132308
  2 blue  0.681229
    red   0.833845
  3 blue  0.278363
    red   0.095278
b 1 blue  0.511612
    red   0.564451
  2 blue  0.708023
    red   0.701554
c 1 blue  0.052607
    red   0.062733
  2 blue  0.268648
    red   0.049134
  3 blue  0.057458
    red   0.199277
  4 blue  0.018762
    red   0.717697

In [104]:
b

        color
          red      blue
a 1  0.132308  0.959557
  2  0.833845  0.681229
  3  0.095278  0.278363
b 1  0.564451  0.511612
  2  0.701554  0.708023
c 1  0.062733  0.052607
  2  0.049134  0.268648
  3  0.199277  0.057458
  4  0.717697  0.018762

In [108]:
b.index.names = ['key1','key2']
b

              color
                red      blue
key1 key2
a    1     0.132308  0.959557
     2     0.833845  0.681229
     3     0.095278  0.278363
b    1     0.564451  0.511612
     2     0.701554  0.708023
c    1     0.062733  0.052607
     2     0.049134  0.268648
     3     0.199277  0.057458
     4     0.717697  0.018762

In [109]:
b.swaplevel('key2','key1')

              color
                red      blue
key2 key1
1    a     0.132308  0.959557
2    a     0.833845  0.681229
3    a     0.095278  0.278363
1    b     0.564451  0.511612
2    b     0.701554  0.708023
1    c     0.062733  0.052607
2    c     0.049134  0.268648
3    c     0.199277  0.057458
4    c     0.717697  0.018762

In [110]:
b.swaplevel('key2','key1').sort_index()

              color
                red      blue
key2 key1
1    a     0.132308  0.959557
     b     0.564451  0.511612
     c     0.062733  0.052607
2    a     0.833845  0.681229
     b     0.701554  0.708023
     c     0.049134  0.268648
3    a     0.095278  0.278363
     c     0.199277  0.057458
4    c     0.717697  0.018762

In [111]:
b

              color
                red      blue
key1 key2
a    1     0.132308  0.959557
     2     0.833845  0.681229
     3     0.095278  0.278363
b    1     0.564451  0.511612
     2     0.701554  0.708023
c    1     0.062733  0.052607
     2     0.049134  0.268648
     3     0.199277  0.057458
     4     0.717697  0.018762

In [114]:
b.sort_index(level=1)

              color
                red      blue
key1 key2
a    1     0.132308  0.959557
b    1     0.564451  0.511612
c    1     0.062733  0.052607
a    2     0.833845  0.681229
b    2     0.701554  0.708023
c    2     0.049134  0.268648
a    3     0.095278  0.278363
c    3     0.199277  0.057458
     4     0.717697  0.018762

### stats on Herachialyy indexes

In [115]:
b

              color
                red      blue
key1 key2
a    1     0.132308  0.959557
     2     0.833845  0.681229
     3     0.095278  0.278363
b    1     0.564451  0.511612
     2     0.701554  0.708023
c    1     0.062733  0.052607
     2     0.049134  0.268648
     3     0.199277  0.057458
     4     0.717697  0.018762

In [116]:
b.sum()

color  red     3.356278
       blue    3.536259
dtype: float64

In [117]:
b.sum(level='key2')

         color
           red      blue
key2
1     0.759493  1.523776
2     1.584533  1.657900
3     0.294555  0.335821
4     0.717697  0.018762

In [118]:
b.sum(level='key1')

         color
           red      blue
key1
a     1.061432  1.919149
b     1.266005  1.219635
c     1.028841  0.397475

### set and reset indexes

In [119]:
b

              color
                red      blue
key1 key2
a    1     0.132308  0.959557
     2     0.833845  0.681229
     3     0.095278  0.278363
b    1     0.564451  0.511612
     2     0.701554  0.708023
c    1     0.062733  0.052607
     2     0.049134  0.268648
     3     0.199277  0.057458
     4     0.717697  0.018762

In [120]:
b.reset_index()

  key1 key2     color
                  red      blue
0    a    1  0.132308  0.959557
1    a    2  0.833845  0.681229
2    a    3  0.095278  0.278363
3    b    1  0.564451  0.511612
4    b    2  0.701554  0.708023
5    c    1  0.062733  0.052607
6    c    2  0.049134  0.268648
7    c    3  0.199277  0.057458
8    c    4  0.717697  0.018762

In [121]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [123]:
a.set_index(['Year','GDP'])

             Country  Population in (m)
Year GDP
2001 3      Pakistan                  2
2002 5         India                 12
2003 4    Bangladesh                  2
2004 4         Nepal                  1

### Merge

In [125]:
a = {
    "Year":[2001,2002,2003,2004],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "GDP":[3,5,4,4],
    "Population in (m)":[2,12,2,1]
}
a = pd.DataFrame(a)

In [126]:
b = {
    "Year":[2001,2002,2003,2004],
    "Capital":["Karachi","Delhi","Bangl","Nepalia"],
    "Country":["Pakistan","India","Bangladesh","Nepal"],
    "Per capita income":[2,3,4,5]
}
b = pd.DataFrame(b)

In [127]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [128]:
b

   Year  Capital     Country  Per capita income
0  2001  Karachi    Pakistan                  2
1  2002    Delhi       India                  3
2  2003    Bangl  Bangladesh                  4
3  2004  Nepalia       Nepal                  5

In [129]:
pd.merge(a,b)

   Year     Country  GDP  Population in (m)  Capital  Per capita income
0  2001    Pakistan    3                  2  Karachi                  2
1  2002       India    5                 12    Delhi                  3
2  2003  Bangladesh    4                  2    Bangl                  4
3  2004       Nepal    4                  1  Nepalia                  5

In [130]:
pd.merge(a,b,on='Country')

,Year_x,Country,GDP,Population in (m),Year_y,Capital,Per capita income
0,2001,Pakistan,3,2,2001,Karachi,2
1,2002,India,5,12,2002,Delhi,3
2,2003,Bangladesh,4,2,2003,Bangl,4
3,2004,Nepal,4,1,2004,Nepalia,5

In [132]:
pd.merge(a,b,on=['Country','Year'])

   Year     Country  GDP  Population in (m)  Capital  Per capita income
0  2001    Pakistan    3                  2  Karachi                  2
1  2002       India    5                 12    Delhi                  3
2  2003  Bangladesh    4                  2    Bangl                  4
3  2004       Nepal    4                  1  Nepalia                  5

In [133]:
b = {
    "Year":[2001,2002,2003],
    "Capital":["Karachi","Delhi","Bangl"],
    "Country":["Pakistan","India","Bangladesh"],
    "Per capita income":[2,3,4]
}
b = pd.DataFrame(b)

In [134]:
pd.merge(a,b)

   Year     Country  GDP  Population in (m)  Capital  Per capita income
0  2001    Pakistan    3                  2  Karachi                  2
1  2002       India    5                 12    Delhi                  3
2  2003  Bangladesh    4                  2    Bangl                  4

In [135]:
pd.merge(a,b,how='outer')

   Year     Country  GDP  Population in (m)  Capital  Per capita income
0  2001    Pakistan    3                  2  Karachi                2.0
1  2002       India    5                 12    Delhi                3.0
2  2003  Bangladesh    4                  2    Bangl                4.0
3  2004       Nepal    4                  1      NaN                NaN

In [136]:
pd.merge(a,b,how='left')

   Year     Country  GDP  Population in (m)  Capital  Per capita income
0  2001    Pakistan    3                  2  Karachi                2.0
1  2002       India    5                 12    Delhi                3.0
2  2003  Bangladesh    4                  2    Bangl                4.0
3  2004       Nepal    4                  1      NaN                NaN

In [137]:
pd.merge(a,b,how='right')

   Year     Country  GDP  Population in (m)  Capital  Per capita income
0  2001    Pakistan    3                  2  Karachi                  2
1  2002       India    5                 12    Delhi                  3
2  2003  Bangladesh    4                  2    Bangl                  4

In [138]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [139]:
b

   Year  Capital     Country  Per capita income
0  2001  Karachi    Pakistan                  2
1  2002    Delhi       India                  3
2  2003    Bangl  Bangladesh                  4

In [143]:
pd.merge(a,b,left_index=True, right_index=True,suffixes=['t1','t2'])

,Yeart1,Countryt1,GDP,Population in (m),Yeart2,Capital,Countryt2,Per capita income
0,2001,Pakistan,3,2,2001,Karachi,Pakistan,2
1,2002,India,5,12,2002,Delhi,India,3
2,2003,Bangladesh,4,2,2003,Bangl,Bangladesh,4

### join

In [144]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [145]:
b

   Year  Capital     Country  Per capita income
0  2001  Karachi    Pakistan                  2
1  2002    Delhi       India                  3
2  2003    Bangl  Bangladesh                  4

### Concat

In [149]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [150]:
b

   Year  Capital     Country  Per capita income
0  2001  Karachi    Pakistan                  2
1  2002    Delhi       India                  3
2  2003    Bangl  Bangladesh                  4

In [151]:
pd.concat([a,b])

/home/mshahzaib/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   Capital     Country  GDP  Per capita income  Population in (m)  Year
0      NaN    Pakistan  3.0                NaN                2.0  2001
1      NaN       India  5.0                NaN               12.0  2002
2      NaN  Bangladesh  4.0                NaN                2.0  2003
3      NaN       Nepal  4.0                NaN                1.0  2004
0  Karachi    Pakistan  NaN                2.0                NaN  2001
1    Delhi       India  NaN                3.0                NaN  2002
2    Bangl  Bangladesh  NaN                4.0                NaN  2003

In [152]:
pd.concat([a,b],keys=['t1','t2'])

/home/mshahzaib/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      Capital     Country  GDP  Per capita income  Population in (m)  Year
t1 0      NaN    Pakistan  3.0                NaN                2.0  2001
   1      NaN       India  5.0                NaN               12.0  2002
   2      NaN  Bangladesh  4.0                NaN                2.0  2003
   3      NaN       Nepal  4.0                NaN                1.0  2004
t2 0  Karachi    Pakistan  NaN                2.0                NaN  2001
   1    Delhi       India  NaN                3.0                NaN  2002
   2    Bangl  Bangladesh  NaN                4.0                NaN  2003

In [153]:
pd.concat([a,b],keys=['t1','t2'],ignore_index=True)

/home/mshahzaib/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   Capital     Country  GDP  Per capita income  Population in (m)  Year
0      NaN    Pakistan  3.0                NaN                2.0  2001
1      NaN       India  5.0                NaN               12.0  2002
2      NaN  Bangladesh  4.0                NaN                2.0  2003
3      NaN       Nepal  4.0                NaN                1.0  2004
4  Karachi    Pakistan  NaN                2.0                NaN  2001
5    Delhi       India  NaN                3.0                NaN  2002
6    Bangl  Bangladesh  NaN                4.0                NaN  2003

In [154]:
pd.concat([a,b],keys=['t1','t2'],axis=1)

     t1                                        t2                       \
   Year     Country GDP Population in (m)    Year  Capital     Country
0  2001    Pakistan   3                 2  2001.0  Karachi    Pakistan
1  2002       India   5                12  2002.0    Delhi       India
2  2003  Bangladesh   4                 2  2003.0    Bangl  Bangladesh
3  2004       Nepal   4                 1     NaN      NaN         NaN


  Per capita income
0               2.0
1               3.0
2               4.0
3               NaN

In [155]:
a

   Year     Country  GDP  Population in (m)
0  2001    Pakistan    3                  2
1  2002       India    5                 12
2  2003  Bangladesh    4                  2
3  2004       Nepal    4                  1

In [157]:
a.pivot('Country','Year')

            GDP                Population in (m)
Year       2001 2002 2003 2004              2001  2002 2003 2004
Country
Bangladesh  NaN  NaN  4.0  NaN               NaN   NaN  2.0  NaN
India       NaN  5.0  NaN  NaN               NaN  12.0  NaN  NaN
Nepal       NaN  NaN  NaN  4.0               NaN   NaN  NaN  1.0
Pakistan    3.0  NaN  NaN  NaN               2.0   NaN  NaN  NaN